SteffenLav/qmx-panadapter/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_REV_MIN_0=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - HPI octal mode for Tab5
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# FreeRTOS
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Stacks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Cache
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
# Phase 2.1 - bump USB enum buffer for devices with large config descriptors (QMX has CDC + UAC)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# v1.3 engineering-sample silicon needs 360MHz max (400MHz default fails clock init)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_FONT_MONTSERRAT_32=y
